Домашняя_бухгалтерия.РасчетЗарплаты/src/Catalogs/РЗ_Задачи/РЗ_Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЗ_Задачи</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Анадитика</name>
    <type>
      <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.РЗ_СостоянияЗадач</types>
    </type>
  </attributes>
</mdclass:Catalog>

Домашняя_бухгалтерия.РасчетЗарплаты/src/InformationRegisters/РЗ_Хронометраж/РЗ_Хронометраж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЗ_Хронометраж</name>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.РЗ_Задачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Домашняя_бухгалтерия.РасчетЗарплаты/src/Enums/РЗ_СостоянияЗадач/РЗ_СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЗ_СостоянияЗадач</name>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>ПереданаЗаказчику</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенаНаДоработку</name>
  </enumValues>
</mdclass:Enum>

Домашняя_бухгалтерия.РасчетЗарплаты/src/Catalogs/РЗ_Задачи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Состояние = Перечисления.РЗ_СостоянияЗадач.Выполняется;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Задача", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.РЗ_Хронометраж.Форма.ФормаВыполненияЗадачи", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьВыполнение(Команда)
	ЗакончитьВыполнениеНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗакончитьВыполнениеНаСервере(Задача)
	РегистрыСведений.РЗ_Хронометраж.ЗавершениеВыполнения(Задача);
КонецПроцедуры // ЗакончитьВыполнениеНаСервере(Задача)
